package Lesson_3.ExercisesForLesson;

//Напишите метод, который принимает двумерный массив целых чисел и выводит его в виде таблицы в консоль

public class Exercise1 {
    public static void main(String[] args) {
        int[][] array = {
                {123, 4, 56},
                {78, 9, 1234},
                {56, 789, 1}
        };

        System.out.println("Двумерный массив в виде таблицы:");
        //printTable(array);
    }

}
