package Lesson_2.exercises;

/*Напишите программу для анализа текста:

Программа должна использовать for-each для подсчета количества букв, цифр и других символов в строке.
Применяйте if/else для определения типа символа (буква, цифра или другой символ).
Используйте switch case для определения, какой именно тип буквы (гласная или согласная).
Используйте математические операторы для подсчета статистики по символам.
Приведение типов понадобится для работы с char и int.
Используйте while для ввода данных и do-while для подтверждения анализа повторно.*/

/*ПЕРЕД ТЕМ КАК ВЫПОЛНЯТЬ ЗАДАНИЕ УДАЛИТЕ *//* и *//* В НАЧАЛЕ И КОНЦЕ БЛОКА КОДА, с текста эти символы удалять НЕ НУЖНО*/

/*public class Exercise11 {
    public static void main(String[] args) {

        String string = "Мне хотелось бы 12 летнюю дочку, ведь моей жене уже 13 ";

        System.out.println("Букв: " + letters);
        System.out.println("Гласных: " + vowels);
        System.out.println("Согласных: " + consonants);
        System.out.println("Цифр: " + digits);
        System.out.println("Других символов: " + others);
    }
}*/
