package Lesson_1.exercises;

/*Калькулятор с использованием switch
Задание на комбинирование типов данных и оператора switch.

Напишите программу, которая выполняет простые арифметические операции (сложение, вычитание, умножение, деление) над двумя числами. Программа должна запрашивать у пользователя два числа и оператор (+, -, *, /), а затем выводить результат.

Пример:

Введите первое число: 15
Введите оператор: +
Введите второе число: 5
Результат: 20
Подсказка: Обработайте случай деления на ноль с помощью дополнительного условия.*/



public class Exercise_6 {

}
