package Lesson_1.exercises;

/*Проверка возраста
Комбинированное задание на использование нескольких условных операторов.

Напишите программу, которая принимает возраст пользователя и выводит сообщение, соответствует ли он следующим категориям:

"Ребенок" — если возраст меньше 12 лет.
"Подросток" — если возраст от 12 до 17 лет.
"Взрослый" — если возраст от 18 до 64 лет.
"Пожилой" — если возраст 65 лет и старше.
Используйте if/else if/else для решения.

Пример:
Введите возраст: 20
Результат: Взрослый*/

public class Exercise_5 {

}
