package Lesson_4.ExerciseForLesson;

/*
Логические выражения

Проверка четности: Напишите алгоритм, который проверяет, является ли введенное число четным. Если число четное, вывести "Четное", иначе — "Нечетное".

Определение принадлежности к диапазону: Напишите алгоритм, который проверяет, входит ли число в диапазон от 10 до 50 включительно. Выведите "Да", если число входит в диапазон, и "Нет" в противном случае.

Определение квадрата числа: Напишите алгоритм, который проверяет, является ли одно число квадратом другого. Пользователь вводит два числа, алгоритм должен вывести "Да", если одно из чисел является квадратом другого, и "Нет" в противном случае.

Проверка кратности: Напишите алгоритм, который проверяет, делится ли одно число на другое без остатка. Пользователь вводит два числа, алгоритм должен вывести "Кратно", если первое число делится на второе, и "Не кратно" в противном случае.

Определение високосного года: Напишите алгоритм, который проверяет, является ли введенный год високосным. Год является високосным, если он делится на 4, но не делится на 100, или если он делится на 400. Выведите "Високосный", если год удовлетворяет этому условию, и "Не високосный" в противном случае.

        Циклы

Сумма чисел от 1 до N: Напишите алгоритм, который вычисляет сумму всех чисел от 1 до N, где N вводится пользователем.

Факториал числа: Напишите алгоритм, который вычисляет факториал числа N (N!) с использованием цикла. Число N вводится пользователем.

Числа Фибоначчи: Напишите алгоритм, который выводит первые N чисел последовательности Фибоначчи. Число N вводится пользователем.

Определение простого числа: Напишите алгоритм, который проверяет, является ли число N простым (простое число делится только на 1 и на само себя). Число N вводится пользователем.

Обратный порядок цифр: Напишите алгоритм, который выводит цифры введенного числа в обратном порядке. Число вводится пользователем.

        Массивы, циклы и логические выражения

Максимум в массиве: Напишите алгоритм, который находит максимальное число в массиве целых чисел, введенных пользователем.

Подсчет четных и нечетных чисел в массиве: Напишите алгоритм, который подсчитывает количество четных и нечетных чисел в массиве, введенном пользователем.

Сортировка массива пузырьком: Реализуйте алгоритм сортировки массива пузырьком. Массив чисел вводится пользователем.

Поиск вхождения числа в массиве: Напишите алгоритм, который проверяет, содержится ли число X в массиве чисел. Если число содержится, алгоритм должен вывести "Найдено", в противном случае — "Не найдено". Массив и число X вводятся пользователем.

Магический квадрат: Напишите алгоритм, который проверяет, является ли заданная матрица магическим квадратом. Магический квадрат — это квадратная матрица, в которой суммы чисел в каждой строке, каждом столбце и на обеих диагоналях равны. Матрица вводится пользователем.
*/

public class Exercise {
}
